openfoam/test_cases/surfaceMountedCube/fullCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            (turbulenceModelSchemes);

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.002;

writeControl    timeStep;

writeInterval   100;

purgeWrite      5;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    // function object for computing the states and actions in order to predict the solver settings for GAMG
    residuals
        {
            type            agentSolverSettings;
            libs            ("${DRL_LIBBIN}/libAgentSolverSettings.so");
            timeStart       1337;
            fields          (p);
            policy          "policy.pt";
            train           true;
            seed            0;
            executeControl      timeStep;
            executeInterval     2;
            writeControl        timeStep;
            writeInterval       2;
    }

    // log the execution time per time step for reward function (in drlfoam) and post-processing
    time
    {
        type            timeInfo;
        libs            (utilityFunctionObjects);
        timeStart       0;
        perTimeStep     yes;
        executeControl      timeStep;
        executeInterval     2;
        writeControl        timeStep;
        writeInterval       2;
    }

    minMax
    {
        type            fieldMinMax;
        libs            (fieldFunctionObjects);
        fields          (U p);
    }

    DESField
    {
        // Mandatory entries
        type            DESModelRegions;
        libs            (fieldFunctionObjects);

        // Optional entries
        result          DESField;

        // Optional (inherited) entries
        writePrecision   6;
        writeToFile      true;
        useUserTime      false;

        region          region0;
        enabled         true;
        log             true;
        timeStart       0;
        timeEnd         1000;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   -1;
    }
    Q1
    {
        type            Q;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }
    vorticity1
    {
        type            vorticity;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }
    yPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }
    fieldAverage1
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        timeStart       10;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }

    sample1
    {
        #include "sample"
    }

    // added
    probes
        {
            type            probes;
            libs            (sampling);
            name            probes;
            writeControl    timeStep;
            writeInterval   10;
            startTime       0.0;
            fields          (U p);
            fixedLocations  true;
            interpolationScheme cell;

            probeLocations
            (
                (5.0 4.2 0.25)
                (6.0 4.2 0.25)
                (7.0 4.2 0.25)

                (5.0 4.8 0.25)
                (6.0 4.8 0.25)
                (7.0 4.8 0.25)

                (5.0 4.2 0.75)
                (6.0 4.2 0.75)
                (7.0 4.2 0.75)

                (5.0 4.8 0.75)
                (6.0 4.8 0.75)
                (7.0 4.8 0.75)

            );
            includeOutOfBounds  false;
        }
}


// ************************************************************************* //
