openfoam/test_cases/surfaceMountedCube/fullCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        smoother         DICGaussSeidel;
        tolerance        1e-8;
        relTol           0.01;
        interpolateCorrection   no;
        nFinestSweeps   2;
    }

    pFinal
    {
        $p;
        tolerance       1e-6;
        relTol           0;
    }

    "(U|k|nuTilda)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }

    "(U|k|nuTilda)Final"
    {
        $U;
        tolerance       1e-07;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;
    nOuterCorrectors    50;

    residualControl
        {

            "(U|k|nuTilda)"
            {
                relTol          0;
                tolerance       1e-5;
            }

            "(p)"
            {
                relTol          0;
                tolerance       1e-4;
            }
        }
}


// ************************************************************************* //
